In [1]:
import pandas as pd
import numpy as np

In [3]:
suppliers = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/northwind/suppliers.csv',
                        usecols=['SupplierID', 'CompanyName', 'City'])
products = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/northwind/products.csv',
                      usecols=['ProductID', 'ProductName', 'SupplierID', 'CategoryID'])
categories = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/northwind/categories1.csv',
                        usecols=['CategoryID', 'CategoryName'], index_col='CategoryID')

In [4]:
suppliers.head(2)

   SupplierID                 CompanyName         City
0           1              Exotic Liquids       London
1           2  New Orleans Cajun Delights  New Orleans

In [5]:
products.head(2)

   ProductID ProductName  SupplierID  CategoryID
0          1        Chai           1           1
1          2       Chang           1           1

In [6]:
categories.head(2)

           CategoryName
CategoryID
1             Beverages
2            Condiments

In [8]:
prod_cat = products.merge(categories, left_on='CategoryID', right_index=True)
prod_cat.head(2)

   ProductID ProductName  SupplierID  CategoryID CategoryName
0          1        Chai           1           1    Beverages
1          2       Chang           1           1    Beverages

In [10]:
prod_cat_sup = prod_cat.merge(suppliers, on='SupplierID')
prod_cat_sup.head(2)

,ProductID,ProductName,SupplierID,CategoryID,CategoryName,CompanyName,City
0,1,Chai,1,1,Beverages,Exotic Liquids,London
1,2,Chang,1,1,Beverages,Exotic Liquids,London

In [11]:
products.merge(categories, left_on='CategoryID', right_index=True).merge(suppliers, on='SupplierID').head(2)

,ProductID,ProductName,SupplierID,CategoryID,CategoryName,CompanyName,City
0,1,Chai,1,1,Beverages,Exotic Liquids,London
1,2,Chang,1,1,Beverages,Exotic Liquids,London